PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
/**
 * @file cdr_interruptServiceHandlers.c
 * This file holds the collection of the ISRs needed to serve the CAN devices.\n
 *   Basically, ISRs are device dependent, but the registered handlers branch soon into
 * other functions, which implement most of the actual handler operation. This way, we have
 * a lot of code sharing between the devices. Still, the number of required registered
 * handler is huge.\n
 *   The large number of registered ISRs is generated by a number of macros, which take
 * device index and related information as macro and can then expand to the needed,
 * specific, registered ISR. Note, the definition of these macros resembles a normal
 * function implementation much more than a typical preprocessor macro. Consequently, we've
 * put them in the function section, where they belong from the logical aspect, rather
 * than in the define section.\n
 *   To enable the implementation of the interrupt services in a common, shared way, we
 * need some lookup tables for device specific settings or data. These are found here, too.
 *
 * Copyright (C) 2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   cdr_osRegisterInterrupts
 * Local functions
 *   isrRxFIFOOverflow
 *   isrRxFIFOWarning
 *   isrRxFIFOFramesAvailable
 */

/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <assert.h>

#include "MPC5748G.h"
#include "cdr_MPC5748G_CAN.h"

#include "rtos.h"
#include "cdr_canDriverAPI.h"
#include "cdr_interruptServiceHandlers.h"


/*
 * Defines
 */


/*
 * Local type definitions
 */


/*
 * Local prototypes
 */

/* Prototypes for all ISRs on all enabled devices. */
#define PROTOTYPES_OF_CAN_ISRS(canDev)              \
static void isrGroupRxFIFO_##canDev(void);          \
/* static void isrGroupError_##canDev(void);   */       \
static void isrGroupMB0_3_##canDev(void);           \
static void isrGroupMB4_7_##canDev(void);           \
static void isrGroupMB8_11_##canDev (void);         \
static void isrGroupMB12_15_##canDev(void);         \
static void isrGroupMB16_31_##canDev(void);         \
static void isrGroupMB32_63_##canDev(void);         \
static void isrGroupMB64_95_##canDev(void);

#if CDR_ENABLE_USE_OF_CAN_0 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_0)
#endif
#if CDR_ENABLE_USE_OF_CAN_1 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_1)
#endif
#if CDR_ENABLE_USE_OF_CAN_2 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_2)
#endif
#if CDR_ENABLE_USE_OF_CAN_3 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_3)
#endif
#if CDR_ENABLE_USE_OF_CAN_4 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_4)
#endif
#if CDR_ENABLE_USE_OF_CAN_5 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_5)
#endif
#if CDR_ENABLE_USE_OF_CAN_6 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_6)
#endif
#if CDR_ENABLE_USE_OF_CAN_7 == 1
PROTOTYPES_OF_CAN_ISRS(CAN_7)
#endif
#undef PROTOTYPES_OF_CAN_ISRS


/*
 * Data definitions
 */


/*
 * Function implementation
 */

/**
 * This is the ISR to handle the situation that a received CAN message can't be placed into
 * the Rx FIFO because it is still full. The message is lost. The ISR records the situation
 * but can recover from the data loss.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 */
static void isrRxFIFOOverflow( CAN_Type * const pDevice
                             , cdr_canDeviceData_t * const pDeviceData
                             )
{
    /* For now, we just record the situation in a global counter. */
    const unsigned int noErr = pDeviceData->noRxFIFOOverflowEvents+1;
    if(noErr != 0)
        pDeviceData->noRxFIFOOverflowEvents = noErr;

    /* RM 43.4.13, p. 1736. Acknowledge the IRQ. */
    const uint32_t irqMaskRxFIFOOverflow = CAN_IFLAG1_BUF7I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFOOverflow) != 0);
    pDevice->IFLAG1 = irqMaskRxFIFOOverflow; /* Clear bit by "w1c" */

} /* End of isrRxFIFOOverflow */




/**
 * This is the ISR to handle the situation that Rx FIFO is nearly full. A message is
 * however not lost yet. The ISR just records the situation but doesn't take an action.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 */
static void isrRxFIFOWarning( CAN_Type * const pDevice
                            , cdr_canDeviceData_t * const pDeviceData
                            )
{
    /* For now, we just record the situation in a counter. */
    const unsigned int noWarn = pDeviceData->noRxFIFOWarningEvents+1;
    if(noWarn != 0)
        pDeviceData->noRxFIFOWarningEvents = noWarn;

    /* RM 43.4.13, p. 1736. Acknowledge the IRQ. */
    const uint32_t irqMaskRxFIFOWarn = CAN_IFLAG1_BUF6I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFOWarn) != 0);
    pDevice->IFLAG1 = irqMaskRxFIFOWarn; /* Clear bit by "w1c" */

} /* End of isrRxFIFOWarning */




/**
 * This is the principal ISR of the Rx FIFO. It is called on completion of an reception.
 * The ISR fetches the payload and some additional information from the CAN device's
 * registers and invokes a callback to some external code, that does do the further
 * evalutaion of the received message data.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pDeviceData
 * The ISR is shared between all CAN devices. The run-time data of the device to operate on
 * is passed in by reference.
 *   @param osCallbackOnRx
 * The notification callback into the client code of the driver.
 */
static void isrRxFIFOFramesAvailable( CAN_Type * const pDevice
                                    , cdr_canDeviceData_t * const pDeviceData
                                    , cdr_osCallbackOnRx_t osCallbackOnRx
                                    )
{
    /* RM 43.4.43, p. 1785: The FIFO is read through the first mailbox in the device RAM.
         Note, the fields inside the C/S word are a bit differently defined as for normal
       mailboxes and we need to apply other access macros. */
    volatile cdr_mailbox_t * const pRxMB = cdr_getMailbox(pDevice, /* idxMB */ 0);

    /* The ISR doesn't need to loop over all messages currently held in the FIFO. The HW
       maintains the flag coherently with the FIFO contents. If several messages are
       contained then it'll re-assert the flag and we will enter this ISR immediately
       again. (See RM 43.5.8, p. 1810) */
    const uint32_t irqMaskRxFIFO = CAN_IFLAG1_BUF5I_MASK;
    assert((pDevice->IFLAG1 & irqMaskRxFIFO) != 0);

    /* Record the Rx situation in a counter. */
    ++ pDeviceData->noRxMsgsFIFO;

    const uint32_t csWord = pRxMB->csWord
                 , canIdWord = pRxMB->canId;
    const bool isExtID = (csWord & CAN_FIFOCS_IDE_MASK) != 0;
    const unsigned int idHit = (csWord & CAN_FIFOCS_IDHIT_MASK) >> CAN_FIFOCS_IDHIT_SHIFT
                     , DLC = (csWord & CAN_FIFOCS_DLC_MASK) >> CAN_FIFOCS_DLC_SHIFT
                     , timeStamp = (csWord & CAN_FIFOCS_TIME_STAMP_MASK)
                                   >> CAN_FIFOCS_TIME_STAMP_SHIFT
                     , canId = isExtID? (canIdWord & CAN_FIFOID_ID_EXT_MASK)
                                        >> CAN_FIFOID_ID_EXT_SHIFT
                                      : (canIdWord & CAN_FIFOID_ID_STD_MASK)
                                        >> CAN_FIFOID_ID_STD_SHIFT
                     ;

    /* Copy received bytes into local buffer for callback invokation. We copy
       unconditionally. Having conditional code or a byte loop would not save any time. */
    assert(DLC <= 8);
    uint32_t payload_u32[2];
    payload_u32[0] = pRxMB->payload_u32[0];
    payload_u32[1] = pRxMB->payload_u32[1];

    /* Acknowledge the IRQ. For normal MBs, we need to do this prior to reading the
       timer (which unlocks the MB and would enable a re-assertion of the interrupt
       flag). */
    pDevice->IFLAG1 = irqMaskRxFIFO; /* Clear bit by "w1c" */

