PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_interruptServiceHandlers.c
    /* RM 43.4.4, p. 1721f: Read the timer register to unlock the evaluated mailbox
       (side-effect of reading). We are ready for next reception while the user
       notification callback is running in parallel. See 43.5.7.3 Mailbox lock mechanism,
       p. 1808ff, for more details. */
    (void)pDevice->TIMER;

    /* Invoke the callback for further data processing.
         Note, a NULL Pointer check is not needed at run-time. We have double
       checked the configuration at driver initialization time. (Which won't hinder
       us from having an assertion here.) */
    assert(osCallbackOnRx != NULL);
    (*osCallbackOnRx)( /* hMsg */ idHit
                     , isExtID
                     , canId
                     , DLC
                     , (const uint8_t *)&payload_u32[0]
                     , timeStamp
                     );
} /* End of isrRxFIFOFramesAvailable */



#define ISR_GROUP_RX_FIFO(canDev)                                                           \
/**                                                                                         \
 * Common ISR for all of the Rx FIFO interrupts. It looks for the causing IRQ and branches  \
 * in the dedicated handler. Interrupt acknowledge needs to be done in the dedicated        \
 * handler.                                                                                 \
 */                                                                                         \
static void isrGroupRxFIFO_##canDev(void)                                                   \
{                                                                                           \
    CAN_Type * const pDevice = (canDev);                                                    \
    if((pDevice->IFLAG1 & CAN_IFLAG1_BUF5I_MASK) != 0)                                      \
    {                                                                                       \
        isrRxFIFOFramesAvailable                                                            \
                    ( pDevice                                                               \
                    , &cdr_canDriverData[cdr_canDev_##canDev]                               \
                    , cdr_canDriverConfig[cdr_canDev_##canDev].irqGroupFIFO.osCallbackOnRx  \
                    );                                                                      \
    }                                                                                       \
    else if((pDevice->IFLAG1 & CAN_IFLAG1_BUF6I_MASK) != 0)                                 \
        isrRxFIFOWarning(pDevice, &cdr_canDriverData[cdr_canDev_##canDev]);                 \
    else if((pDevice->IFLAG1 & CAN_IFLAG1_BUF7I_MASK) != 0)                                 \
        isrRxFIFOOverflow(pDevice, &cdr_canDriverData[cdr_canDev_##canDev]);                \
    else                                                                                    \
        assert(false);                                                                      \
                                                                                            \
} /* End of isrGroupRxFIFO_##canDev */



/**
 * This is the common part of the implementation of all mailbox ISRs. It is called on
 * completion of a reception or transmission.
 *   @param pDevice
 * The ISR is shared between all CAN devices. The device to operate on is passed in by
 * reference.
 *   @param pIFLAG
 * The ISR is shared between all mailboxes. The information to identify the IRQ requesting
 * mailbox is passed in. Here related register IFLAG1/2/3 of the CAN device by reference.
 *   @param idxMBOffset
 * This is the mailbox index of the first mailbox, in the group, which possibly requested
 * the IRQ. It is the index of the mailbox, whose interrupt flag is found with \a maskFrom
 * in flag register * \a pIFLAG.
 *   @param maskFrom
 * The ISR is shared between all mailboxes. The information to identify the IRQ requesting
 * mailbox is passed in. Here the bit mask to touch the interrupt flag of the first
 * mailbox, which possibly requested the IRQ.
 *   @param maskTo
 * The ISR is shared between all mailboxes. The information to identify the IRQ requesting
 * mailbox is passed in. Here the bit mask to touch the interrupt flag of the last
 * mailbox in the given group, which possibly requested the IRQ.
 *   @param pIrqConfig
 * The user provided configuration of the applicable interrupt group is passed by
 * reference. It is required to identify the notification callback into the client code.
 */
static void isrMailbox( CAN_Type * const pDevice
                      , volatile uint32_t *pIFLAG
                      , unsigned int idxMBOffset
                      , uint32_t maskFrom
                      , uint32_t maskTo
                      , const cdr_mailboxIrqConfig_t * const pIrqConfig
                      )
{
    while(true)
    {
        /* Check mailbox candidate for newly received input. */
        if((*pIFLAG & maskFrom) == 0)
        {
            /* This is not the causing mailbox - try next one. */
            if(maskFrom == maskTo)
            {
                /* This code must be never reached. We are in the ISR but don't see any of
                   the related interrupt flags set. All we can do is ignoring the interrupt
                   request. Evidently, there's not even a flag bit to reset. */
                assert(false);
                return;
            }
            else
            {
                /* This is not the causing mailbox - try next one. */
                ++ idxMBOffset;
                maskFrom <<= 1;
                continue;
            }
        } /* End if(Did we identify the interrupt requesting mailbox?) */

        /* If we get here then we have found the causing mailbox. It is mailbox
           idxMBOffset. */
        volatile cdr_mailbox_t * const pMB = cdr_getMailbox(pDevice, idxMBOffset);

        /* Read the mailbox CODE: It tells whether we have an Rx or Tx message and what
           happened. See RM 43.4.40, p. 1771ff, Tables 43-8 and 43-9, for the different
           status codes. */
        const uint32_t csWord = pMB->csWord
                     , canIdWord = pMB->canId;
        const bool isExtID = (csWord & CAN_FIFOCS_IDE_MASK) != 0;
        const unsigned int DLC = (csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT
                         , timeStamp = (csWord & CAN_MBCS_TIME_STAMP_MASK)
                                       >> CAN_MBCS_TIME_STAMP_SHIFT
                         , canId = isExtID? (canIdWord & CAN_MBID_ID_EXT_MASK)
                                            >> CAN_MBID_ID_EXT_SHIFT
                                          : (canIdWord & CAN_MBID_ID_STD_MASK)
                                            >> CAN_MBID_ID_STD_SHIFT
                         ;
        const uint32_t CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
        const bool isRx = (CODE & 0x8) == 0;

